app/controllers/movies_controller.rb

    end

    # Llenamos el objeto con los datos que coincidad con el rating
    @movies = Movie.where(:rating => @ratings).order(@sort)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG') ORDER BY release_date